app/controllers/principal_controller.rb

  def digiread

    time = Time.new

    ano = time.year
    mes = time.month
    dia = time.day
    fecha_completa = "#{dia}/#{mes}/#{ano}"

    #@arduino = Arduino.new(params[:arduino])

    @arduino = Arduino.new(texto: 'arduino', valor: 255, fecha: fecha_completa)


   @arduino.save
---
INSERT INTO "arduinos" ("texto", "valor", "fecha", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["texto", "The Hobbit"], ["valor", 1234], ["fecha", Fri, 03 Mar 2017], ["created_at", 2017-04-26 04:33:24 UTC], ["updated_at", 2017-04-26 04:33:24 UTC]]